cases/steckler/constant/PsiLookup.txt
101 101
100.00   1.00   0.50   0.00
101 101
200.00   1.00   0.50   0.00
