cases/steckler/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0001;

boundaryField
{
    top
    {
        type            inletOutlet;
        inletValue      uniform 0.0001;
        value           uniform 0.0001;
    }
    sides
    {
        type            inletOutlet;
        inletValue      uniform 0.0001;
        value           uniform 0.0001;
    }
    base
    {
        type            zeroGradient;
    }
    burner
    {
        type            fixedValue;
        value           uniform 0.0001;
    }
    floor
    {
        type            zeroGradient;
    }
    baffle1DWall_master
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.01;
    }
    baffle1DWall_slave
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.01;
    }
}


// ************************************************************************* //
