cases/steckler/0/muSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      muSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 1e-08;

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    sides
    {
        type            zeroGradient;
    }
    base
    {
        type            fixedValue;
        value           uniform 0;
    }
    burner
    {
        type            zeroGradient;
    }
    floor
    {
        type            fixedValue;
        value           uniform 0;
    }
    baffle1DWall_master
    {
        type            calculated;
        value           uniform 0;
    }
    baffle1DWall_slave
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
